Repository: khalfi10/cod_project
Catalog: languages/hajri-cod-shop-*.po
Languages: ar

source: Hajri COD Shop
ar: متجر الدفع عند الاستلام حجري

source: Orders
ar: الطلبات

source: Products
ar: المنتجات

source: Abandoned Carts
ar: سلات التسوق المتروكة

source: Analytics
ar: التحليلات

source: Algerian Delivery Companies
ar: شركات التوصيل الجزائرية

source: Delivery Companies
ar: شركات التوصيل

source: Algerian Wilayas & Municipalities
ar: الولايات والبلديات الجزائرية

source: Wilayas & Municipalities
ar: الولايات والبلديات

source: Settings
ar: الإعدادات

source: Permission denied.
ar: تم رفض الإذن.

source: City name is required.
ar: اسم المدينة مطلوب.

source: Shipping cost updated successfully.
ar: تم تحديث تكلفة الشحن بنجاح.

source: Failed to update shipping cost.
ar: فشل تحديث تكلفة الشحن.

source: Invalid order ID.
ar: معرف الطلب غير صالح.

source: Status is required.
ar: الحالة مطلوبة.

source: Order status updated successfully.
ar: تم تحديث حالة الطلب بنجاح.

source: Failed to update order status.
ar: فشل تحديث حالة الطلب.

source: Invalid cart ID.
ar: معرف السلة غير صالح.

source: Abandoned cart deleted successfully.
ar: تم حذف السلة المتروكة بنجاح.

source: Failed to delete abandoned cart.
ar: فشل حذف السلة المتروكة.

source: Algerian Locations (Wilayas & Municipalities)
ar: المواقع الجزائرية (الولايات والبلديات)

source: Secondary menu
ar: القائمة الثانوية

source: Wilayas (Provinces)
ar: الولايات (المحافظات)

source: Municipalities
ar: البلديات

source: Import/Export
ar: استيراد/تصدير

source: Manage Wilayas
ar: إدارة الولايات

source: Add New Wilaya
ar: إضافة ولاية جديدة

source: Search wilayas...
ar: البحث عن الولايات...

source: Search
ar: بحث

source: Code
ar: الرمز

source: Name (FR)
ar: الاسم (فرنسي)

source: Name (AR)
ar: الاسم (عربي)

source: Shipping Cost
ar: تكلفة الشحن

source: Delivery Days
ar: أيام التوصيل

source: Status
ar: الحالة

source: Actions
ar: الإجراءات

source: Loading wilayas...
ar: جاري تحميل الولايات...

source: Manage Municipalities
ar: إدارة البلديات

source: Add New Municipality
ar: إضافة بلدية جديدة

source: Filter by Wilaya:
ar: تصفية حسب الولاية:

source: All Wilayas
ar: جميع الولايات

source: Search municipalities...
ar: البحث عن البلديات...

source: Wilaya
ar: الولاية

source: Postal Code
ar: الرمز البريدي

source: Extra Fee
ar: رسوم إضافية

source: Select a wilaya to view municipalities
ar: اختر ولاية لعرض البلديات

source: Import/Export Locations
ar: استيراد/تصدير المواقع

source: Import Locations from JSON
ar: استيراد المواقع من ملف JSON

source: You can import wilayas and municipalities from a JSON file. The JSON file should follow the required format.
ar: يمكنك استيراد الولايات والبلديات من ملف JSON. يجب أن يتبع ملف JSON التنسيق المطلوب.

source: JSON File:
ar: ملف JSON:

source: Import Locations
ar: استيراد المواقع

source: JSON Format Example
ar: مثال تنسيق JSON

source: The JSON file should follow this format:
ar: يجب أن يتبع ملف JSON هذا التنسيق:

source: Wilaya Code:
ar: رمز الولاية:

source: Enter a 1 or 2-digit code (e.g. 16)
ar: أدخل رمزًا من 1 أو 2 رقم (مثل 16)

source: Enter a 1 or 2-digit numeric code (e.g. 16 for Algiers)
ar: أدخل رمزًا رقميًا مكونًا من 1 أو 2 رقم (مثل 16 للجزائر)

source: Wilaya Name (French):
ar: اسم الولاية (بالفرنسية):

source: Wilaya Name (Arabic):
ar: اسم الولاية (بالعربية):

source: Shipping Cost (DZD):
ar: تكلفة الشحن (دينار جزائري):

source: Delivery Days:
ar: أيام التوصيل:

source: Status:
ar: الحالة:

source: Active
ar: نشط

source: Inactive
ar: غير نشط

source: Save Wilaya
ar: حفظ الولاية

source: Cancel
ar: إلغاء

source: Wilaya:
ar: الولاية:

source: Select a Wilaya
ar: اختر ولاية

source: Municipality Code:
ar: رمز البلدية:

source: Enter a 4-digit code (e.g. 1601)
ar: أدخل رمزًا مكونًا من 4 أرقام (مثل 1601)

source: Enter a 4-digit code (e.g. 1601 for Algiers Centre)
ar: أدخل رمزًا مكونًا من 4 أرقام (مثل 1601 لوسط الجزائر)

source: Municipality Name (French):
ar: اسم البلدية (بالفرنسية):

source: Municipality Name (Arabic):
ar: اسم البلدية (بالعربية):

source: Postal Code:
ar: الرمز البريدي:

source: Enter a 5-digit postal code (e.g. 16000)
ar: أدخل رمزًا بريديًا مكونًا من 5 أرقام (مثل 16000)

source: Extra Fee (DZD):
ar: رسوم إضافية (دينار جزائري):

source: Additional fee to be added to the wilaya shipping cost
ar: رسوم إضافية تضاف إلى تكلفة شحن الولاية

source: Save Municipality
ar: حفظ البلدية

source: Confirm Deletion
ar: تأكيد الحذف

source: Are you sure you want to delete this item? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا العنصر؟ لا يمكن التراجع عن هذا الإجراء.

source: Yes, Delete It
ar: نعم، احذفه

source: No wilayas found.
ar: لم يتم العثور على ولايات.

source: DZD
ar: دينار جزائري

source: days
ar: أيام

source: Edit
ar: تعديل

source: Deactivate
ar: تعطيل

source: Activate
ar: تفعيل

source: Delete
ar: حذف

source: Error loading wilayas.
ar: حدث خطأ أثناء تحميل الولايات.

source: No municipalities found.
ar: لم يتم العثور على بلديات.

source: Error loading municipalities.
ar: حدث خطأ أثناء تحميل البلديات.

source: Error loading wilaya details.
ar: حدث خطأ أثناء تحميل تفاصيل الولاية.

source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.

source: Delete Wilaya
ar: حذف الولاية

source: Are you sure you want to delete this wilaya? This action cannot be undone. Note: Wilayas with municipalities cannot be deleted.
ar: هل أنت متأكد أنك تريد حذف هذه الولاية؟ لا يمكن التراجع عن هذا الإجراء. ملاحظة: لا يمكن حذف الولايات التي تحتوي على بلديات.

source: Error loading municipality details.
ar: حدث خطأ أثناء تحميل تفاصيل البلدية.

source: Delete Municipality
ar: حذف البلدية

source: Are you sure you want to delete this municipality? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذه البلدية؟ لا يمكن التراجع عن هذا الإجراء.
